{"lastFetch":1761652546232,"data":{"edhrec":[{"title":"The Over/Under - A Review of Bloomburrow Commanders","link":"https://edhrec.com/articles/the-over-under-a-review-of-bloomburrow-commanders/","contentSnippet":"Kyle's dredging up the Over/Under for Bloomburrow from last year to see how well his predictions held up for the set's commanders.\nThe post The Over/Under - A Review of Bloomburrow Commanders appeared first on EDHREC.","source":"EDHREC"},{"title":"The 10 Most Popular Cards From Shadowmoor Block","link":"https://edhrec.com/articles/the-10-most-popular-cards-from-shadowmoor-block/","contentSnippet":"With Lorwyn Eclipsed hitting the shelves in January, let's take a look at the most popular cards from the Shadowmoor block for Commander.\nThe post The 10 Most Popular Cards From Shadowmoor Block appeared first on EDHREC.","source":"EDHREC"},{"title":"EDHREC Guide to Mana in cEDH","link":"https://edhrec.com/articles/edhrec-guide-to-mana-in-cedh/","contentSnippet":"| Art by Steve Prescott In cEDH, games can end at any moment. Turbo players try to explode the table on turn one. Midrange players grind out value over the long game. Stax players set the lock early, then capitalize later. Regardless of archetype, however, all decks can agree on one binding principle: more mana […]\nThe post EDHREC Guide to Mana in cEDH appeared first on EDHREC.","source":"EDHREC"},{"title":"Michelangelo, the Heart & Donatello, the Brains Deck Tech","link":"https://edhrec.com/articles/michelangelo-the-heart-donatello-the-brains-deck-tech/","contentSnippet":"Food, Mutagen, +1/+1 counters... the pair of Michelangelo and Donatello in a Commander deck have a lot going on. Let's see how to play them.\nThe post Michelangelo, the Heart & Donatello, the Brains Deck Tech appeared first on EDHREC.","source":"EDHREC"},{"title":"Pauper Commander - Vizkopa Guildmage","link":"https://edhrec.com/articles/pauper-commander-vizkopa-guildmage/","contentSnippet":"Alejandro builds a bloodsucking, lifelinking Pauper Commander deck around Vizkopa Guildmage for Halloween.\nThe post Pauper Commander - Vizkopa Guildmage appeared first on EDHREC.","source":"EDHREC"},{"title":"What the Brackets Reveal about Commander | EDHRECast 389 | Magic: the Gathering | Commander","link":"https://edhrec.com/articles/what-the-brackets-reveal-about-commander-edhrecast-389-magic-the-gathering-commander/","contentSnippet":"Access to exclusive content & more on Patreon! https://patreon.com/edhrecast Get new cards on Cardsphere! https://www.cardsphere.com/welcome?referrer=edhrecast Proud partners with DragonShield: https://www.dragonshield.com/?ref=edhrecast Our decklists: https://archidekt.com/edhrecast Brackets Update info HERE: https://magic.wizards.com/en/news/announcements/commander-brackets-beta-update-october-21-2025 Follow the cast on social media: @EDHRECast @JosephMSchultz @danaroach @mathimus55 00:00 Intros 02:45 Removed Game Changers 08:46 Immediate Impressions 15:50 Turn Counts 28:35 Tutors 39:22 Changes We'd […]\nThe post What the Brackets Reveal about Commander | EDHRECast 389 | Magic: the Gathering | Commander appeared first on EDHREC.","source":"EDHREC"},{"title":"Underplayed Partner Options for Tevesh Szat, Doom of Fools","link":"https://edhrec.com/articles/underplayed-partner-options-for-tevesh-szat-doom-of-fools/","contentSnippet":"What do you do with Tevesh Szat, Doom of Fools? The partner options seem endless! This Technically Playable has some ideas for you.\nThe post Underplayed Partner Options for Tevesh Szat, Doom of Fools appeared first on EDHREC.","source":"EDHREC"},{"title":"EDHREC Guide to Aristocrats in Commander","link":"https://edhrec.com/articles/edhrec-guide-to-aristocrats-in-commander/","contentSnippet":"Want to build a deadly good Aristocrats Commander deck? Cooper's got you covered with EDHREC's guide to the death-centric strategy.\nThe post EDHREC Guide to Aristocrats in Commander appeared first on EDHREC.","source":"EDHREC"},{"title":"Does Blue Deserve the Hate It Gets in Commander?","link":"https://edhrec.com/articles/does-blue-deserve-the-hate-it-gets-in-commander/","contentSnippet":"A lot of Commander players hate the color blue. But is that hatred deserved? Don't other colors commit sins just as heinous as blue?\nThe post Does Blue Deserve the Hate It Gets in Commander? appeared first on EDHREC.","source":"EDHREC"},{"title":"Leonardo, Sewer Samurai Commander Deck Tech","link":"https://edhrec.com/articles/leonardo-sewer-samurai-commander-deck-tech/","contentSnippet":"Looking to make a powerful mono-white Commander deck with the potential to storm off? Check this tech for Leonardo, Sewer Samurai.\nThe post Leonardo, Sewer Samurai Commander Deck Tech appeared first on EDHREC.","source":"EDHREC"}],"goldfish":[{"title":"Podcast 559: Magic is Going Up, Up, Up","link":"https://www.mtggoldfish.com/articles/podcast-559-magic-is-going-up-up-up","contentSnippet":"The crew talks the state of Standard, makes some ban list predictions, discusses Hasbro CEO Chris Cocks' comments and more!","source":"MTGGoldfish.com"},{"title":"Much Abrew: Hatchery Smallpox (Legacy","link":"https://www.mtggoldfish.com/articles/much-abrew-hatchery-smallpox-legacy","contentSnippet":"Can an Edge of Eternities land make Smallpox a real deck in Legacy? Let's find out!","source":"MTGGoldfish.com"},{"title":"Weekly Update (Oct 26): Is Universes Beyond Ruining Commander?","link":"https://www.mtggoldfish.com/articles/weekly-update-oct-26-is-universes-beyond-ruining-commander","contentSnippet":"This week in MTG news: Is Universes Beyond Ruining Commander?.","source":"MTGGoldfish.com"},{"title":"The Real Reason For The Hybrid Rules Change In Commander","link":"https://www.mtggoldfish.com/articles/the-real-reason-for-the-hybrid-rules-change-in-commander","contentSnippet":"Tomer talks about the proposed hybrid rules change in Commander!","source":"MTGGoldfish.com"},{"title":"Destroy Everything Every Turn | Brewer's Kitchen","link":"https://www.mtggoldfish.com/articles/destroy-everything-every-turn-brewer-s-kitchen","contentSnippet":"Brewer's Kitchen plays some fair and balanced Magic","source":"MTGGoldfish.com"},{"title":"Single Scoop: Golgari Rock found the Perfect Hunter","link":"https://www.mtggoldfish.com/articles/single-scoop-golgari-rock-found-the-perfect-hunter","contentSnippet":"The classic Golgari rock play style is still around and just found the perfect hunter to include in Brako!","source":"MTGGoldfish.com"},{"title":"Much Abrew: Opposition Agent is Coming for Your Fetchlands (Timeless)","link":"https://www.mtggoldfish.com/articles/much-abrew-opposition-agent-is-coming-for-your-fetchlands-timeless","contentSnippet":"Wizards unleashed Opposition Agent on Timeless, so let's fizzle some fetch lands!","source":"MTGGoldfish.com"},{"title":"We Analyzed Our Commander Playgroup | Commander Clash S18 E33","link":"https://www.mtggoldfish.com/articles/we-analyzed-our-commander-playgroup-commander-clash-s18-e33","contentSnippet":"Next week we kick off season 19 of Commander Clash, but first it's time to wrap up season 18 with a deep delve into the stats!","source":"MTGGoldfish.com"},{"title":"Single Scoop: Mardu Barbed Servitor Self Destruct ","link":"https://www.mtggoldfish.com/articles/single-scoop-mardu-barbed-servitor-self-destruct","contentSnippet":"Barbed Servitor will be teaming up with tons of cards that punish our opponents for when they take damage!","source":"MTGGoldfish.com"},{"title":"Vintage 101: October Vintage Metagame Review","link":"https://www.mtggoldfish.com/articles/vintage-101-october-vintage-metagame-review","contentSnippet":"Joe Dyer takes a look at where Vintage is at in October 2025!","source":"MTGGoldfish.com"},{"title":"This Week in Legacy: Interview with the NA 2025 Legacy Champion","link":"https://www.mtggoldfish.com/articles/this-week-in-legacy-interview-with-the-na-2025-legacy-champion","contentSnippet":"Joe Dyer talks to the 2025 NA EW Legacy Champion!","source":"MTGGoldfish.com"},{"title":"Against the Odds: Two Hours of Turbo Spider Fog to Fall Asleep To ","link":"https://www.mtggoldfish.com/articles/against-the-odds-two-hours-of-turbo-spider-fog-to-fall-asleep-to","contentSnippet":"We recently got some spicy new Fogs on Arena, which means it's time to prevent some damage, again and again and again and again...","source":"MTGGoldfish.com"},{"title":"Commander Clash Podcast 222: Is Universes Beyond Ruining Commander?","link":"https://www.mtggoldfish.com/articles/commander-clash-podcast-222-is-universes-beyond-ruining-commander","contentSnippet":"Is it just too much?","source":"MTGGoldfish.com"},{"title":"Single Scoop: Gruul is The Answer for Aggro Artifacts","link":"https://www.mtggoldfish.com/articles/single-scoop-gruul-is-the-answer-for-aggro-artifacts","contentSnippet":"A few weeks back we went about it all wrong for artifact aggression. It seems like Gruul is the shell to help Fizik/Iron Spider pop off as you get to have Patchwork Bestie and more!","source":"MTGGoldfish.com"},{"title":"Podcast 558: Sorry for Ruining Spider-Man","link":"https://www.mtggoldfish.com/articles/podcast-558-sorry-for-ruining-spider-man","contentSnippet":"Please no Pinkertons.","source":"MTGGoldfish.com"},{"title":"Meme or Dream? I Spent All My Wildcards on Legally Distinct Spider People (Standard)","link":"https://www.mtggoldfish.com/articles/meme-or-dream-i-spent-all-my-wildcards-on-legally-distinct-spider-people-standard","contentSnippet":"35 spider people? 25 Lands? Zero Spells? It must be Meme or Dream? time!","source":"MTGGoldfish.com"},{"title":"Weekly Update (Oct 19): When No One Could Find Modern's Best Deck For Years","link":"https://www.mtggoldfish.com/articles/weekly-update-oct-19-when-no-one-could-find-modern-s-best-deck-for-years","contentSnippet":"This week in MTG news: When No One Could Find Modern's Best Deck For Years.","source":"MTGGoldfish.com"},{"title":"The Power of Pauper: Pili-Pala!","link":"https://www.mtggoldfish.com/articles/the-power-of-pauper-pili-pala","contentSnippet":"Joe Dyer takes a look at Pili-Pala Combo decks in Pauper!","source":"MTGGoldfish.com"},{"title":"Single Scoop: The Eluge Saga Means We Never Pay for Spells!","link":"https://www.mtggoldfish.com/articles/single-scoop-the-eluge-saga-means-we-never-pay-for-spells","contentSnippet":"Cloning Eluge with The Clone Saga/Lost in Littjara means our instants and sorceries will be forever free!","source":"MTGGoldfish.com"},{"title":"Grandma Voltron Takes Over the Pod | Commander Clash S18 E32","link":"https://www.mtggoldfish.com/articles/grandma-voltron-takes-over-the-pod-commander-clash-s18-e32","contentSnippet":"The crew wraps up season 18 with a revenge episode, bringing back decks from earlier in the season that failed to perform!","source":"MTGGoldfish.com"},{"title":"Much Abrew: Infinite Carnage (Pioneer)","link":"https://www.mtggoldfish.com/articles/much-abrew-infinite-carnage-pioneer","contentSnippet":"Is there some combo potential hiding behind Carnage, Crimson Chaos's mayhem? Let's find out!","source":"MTGGoldfish.com"},{"title":"Vintage 101: North America Eternal Weekend 2025 Vintage Championship","link":"https://www.mtggoldfish.com/articles/vintage-101-north-america-eternal-weekend-2025-vintage-championship","contentSnippet":"Joe Dyer dives into the 2025 NA Vintage Champs event at Eternal Weekend!","source":"MTGGoldfish.com"},{"title":"Single Scoop:  This Abzan Deck is Loaded With Multiple Combos.","link":"https://www.mtggoldfish.com/articles/single-scoop-this-abzan-deck-is-loaded-with-multiple-combos","contentSnippet":"*Slaps the top of deck* \r\n\r\nThis Abzan deck has got a few combos to play with.","source":"MTGGoldfish.com"},{"title":"This Week in Legacy: North America Eternal Weekend 2025 Legacy Championship","link":"https://www.mtggoldfish.com/articles/this-week-in-legacy-north-america-eternal-weekend-2025-legacy-championship","contentSnippet":"Joe Dyer dives into the results from the 2025 North America Eternal Weekend's Legacy Champs event!","source":"MTGGoldfish.com"},{"title":"Teaching Arena Zoomers about Iona (Historic)","link":"https://www.mtggoldfish.com/articles/teaching-arena-zoomers-about-iona-historic","contentSnippet":"Iona, Shield of Emeria is one of the most brutal cards ever made. And it just showed up on Magic Arena for the first time, so...","source":"MTGGoldfish.com"}],"draftsim":[{"title":"Everything You Need to Know About MTG Arena Direct, Plus: Is It Worth It?","link":"https://draftsim.com/mtg-arena-direct/","contentSnippet":"MTG Arena’s Festival in a Box event from 2023 created lots of buzz from players excited to compete over real, physical prizes. It adds a juicy level of stakes to the online events with a tangible reward.\nThe post Everything You Need to Know About MTG Arena Direct, Plus: Is It Worth It? appeared first on Draftsim.","source":"Draftsim"},{"title":"What’s in an MTG Mystery Booster? Is it Worth Buying?","link":"https://draftsim.com/mystery-booster-mtg/","contentSnippet":"In the before times (2019 to be precise), WotC began whetting our appetites with a brand-new product that was simply called “Mystery Booster.” Let’s explore the Mystery Booster and what it contains. What is it like to draft, and is it worth buying if it comes back to your LGS?\nThe post What’s in an MTG Mystery Booster? Is it Worth Buying? appeared first on Draftsim.","source":"Draftsim"},{"title":"The 74 Best Black Creatures in Magic Ranked","link":"https://draftsim.com/mtg-black-creatures/","contentSnippet":"From sewer vermin and rotting zombie corpses to nefarious demons and blood-sucking vampires, black has a large scope of iconic creatures. Today we’re exploring the best of the best.\nThe post The 74 Best Black Creatures in Magic Ranked appeared first on Draftsim.","source":"Draftsim"},{"title":"Toph, the First Metalbender Commander Deck Guide","link":"https://draftsim.com/toph-edh-deck/","contentSnippet":"Toph, the First Metalbender is the flavor winner from Avatar: The Last Airbender, a card that combines the new earthbend mechanic with artifacts to embody the skill and craft of the first metalbender.\nThe post Toph, the First Metalbender Commander Deck Guide appeared first on Draftsim.","source":"Draftsim"},{"title":"The 35 Best Instant and Sorcery Recursion Cards in Magic Ranked","link":"https://draftsim.com/mtg-instant-sorcery-recursion/","contentSnippet":"Normally, once you cast these spells, they go straight to the graveyard and stay there. Recursion lets you recover them for another round. It’s a powerful way to squeeze extra value out of your spells and keep the game in your control.\nThe post The 35 Best Instant and Sorcery Recursion Cards in Magic Ranked appeared first on Draftsim.","source":"Draftsim"},{"title":"Supply of Dominant Multi-Format All-Star Runs Dangerously Low","link":"https://draftsim.com/mtg-quantum-riddler-spike-2/","contentSnippet":"Edge of Eternities' most impactful card has a very good chance of becoming the most expensive card in all of Standard.\nThe post Supply of Dominant Multi-Format All-Star Runs Dangerously Low appeared first on Draftsim.","source":"Draftsim"},{"title":"PlayStation’s Ghost of Tsushima Gives Modern Horizons Zombie Ninja New Life","link":"https://draftsim.com/mtg-fallen-shinobi-spike/","contentSnippet":"Near-mint copies of Modern Horizon's Fallen Shinobi have gone way up thanks to this new samurai ghost.\nThe post PlayStation’s Ghost of Tsushima Gives Modern Horizons Zombie Ninja New Life appeared first on Draftsim.","source":"Draftsim"},{"title":"Fan Favorite Avatar Character is a Hardcore Combo Commander","link":"https://draftsim.com/fire-lord-zuko-combo-commander/","contentSnippet":"Everything in Commander was working in perfect harmony, until Zuko and the Fire Nation attacked. The new Mardu commander is just perfect for a combo deck built around both of its abilities.\nThe post Fan Favorite Avatar Character is a Hardcore Combo Commander appeared first on Draftsim.","source":"Draftsim"},{"title":"The 30 Best Bant Creatures in Magic Ranked","link":"https://draftsim.com/mtg-bant-creature/","contentSnippet":"Bant is a very midrange color trio that’s good at ramping and generating value with its creatures and permanents, which means you're in for tons of card draw, ramp, and interaction with these creatures.\nThe post The 30 Best Bant Creatures in Magic Ranked appeared first on Draftsim.","source":"Draftsim"},{"title":"The 35 Best Esper Cards in Magic Ranked","link":"https://draftsim.com/mtg-esper-cards/","contentSnippet":"If you’re a fan of precision, control, and outsmarting your opponents, Esper might be the color identity for you. Whether you’re building a fresh deck or just want to see what makes Esper such a strategic powerhouse in MTG, stick around to discover some of the most potent and game-defining cards it offers.\nThe post The 35 Best Esper Cards in Magic Ranked appeared first on Draftsim.","source":"Draftsim"}]}}